aleksMuhicFri2/stm32n6-edge-audio-classifier/Projects/GS/Src/audio_display.c
  if (waiting)
  {
    s_session_active = false;
    s_session_recognized = false;
    s_session_label[0] = '\0';
    s_session_percent = 0U;
    s_session_hazard = HAZARD_INFO;
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
    return;
  }

  if (!s_session_active)
  {
    s_session_active = true;
    s_session_recognized = false;
    s_session_label[0] = '\0';
    s_session_percent = 0U;
    s_session_hazard = HAZARD_INFO;
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
  }

  if (unknown)
  {
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
    return;
  }

  const char *display_label = friendly_label(decision_label);
  const HazardLevel_t hazard = hazard_for_label(decision_label);

  if (!s_session_recognized)
  {
    s_session_recognized = true;
    (void)snprintf(s_session_label, sizeof(s_session_label), "%s", display_label);
    s_session_percent = percent;
    s_session_hazard = hazard;
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
    add_event(display_label, percent, hazard, now_seconds);
    latch_alert(display_label, hazard);
  }
  else if (strcmp(s_session_label, display_label) == 0)
  {
    s_challenger_label[0] = '\0';
    s_challenger_count = 0U;
    if (percent > s_session_percent)
    {
      s_session_percent = percent;
      s_history[0].confidence_percent = percent;
    }
  }
  else
  {
    if (strcmp(s_challenger_label, display_label) == 0)
    {
      s_challenger_count++;
    }
    else
    {
      (void)snprintf(s_challenger_label, sizeof(s_challenger_label),
                     "%s", display_label);
      s_challenger_count = 1U;
    }

    if (s_challenger_count >= DASHBOARD_CLASS_SWITCH_CONFIRM_WINDOWS)
    {
      const bool revising_latched_alert =
          s_alert_latched && (strcmp(s_alert_label, s_session_label) == 0);
      (void)snprintf(s_session_label, sizeof(s_session_label), "%s", display_label);
      s_session_percent = percent;
      s_session_hazard = hazard;
      s_challenger_label[0] = '\0';
      s_challenger_count = 0U;
      revise_current_event(display_label, percent, hazard);
      if (revising_latched_alert && (hazard == HAZARD_INFO))
      {
        s_alert_latched = false;
        s_alert_label[0] = '\0';
        s_alert_hazard = HAZARD_INFO;
      }
      latch_alert(display_label, hazard);
    }
  }
}

static void draw_header(void)
{
  char uptime[20];
  const uint32_t now_seconds = HAL_GetTick() / 1000U;

  fill_rect(0U, 0U, DISPLAY_WIDTH, 68U, COLOR_HEADER);
  draw_text(24U, 20U, "AUDIO HAZARD DETECTOR", 3U, COLOR_WHITE);

  format_elapsed(now_seconds, uptime, sizeof(uptime));
  draw_text(610U, 17U, uptime, 1U, COLOR_MUTED);
  fill_rect(610U, 37U, 166U, 20U, COLOR_CARD_ALT);
  fill_rect(622U, 43U, 8U, 8U,
            s_monitoring_enabled ? COLOR_GREEN : COLOR_ORANGE);
  draw_text(642U, 40U,
            s_monitoring_enabled ? "MONITORING" : "PAUSED",
            1U, s_monitoring_enabled ? COLOR_GREEN : COLOR_ORANGE);
}

static void draw_confidence(uint32_t percent, uint16_t color)
{
  char text[12];
  const uint32_t bounded_percent = (percent > 100U) ? 100U : percent;
  const uint32_t bar_width = (530U * bounded_percent) / 100U;

  draw_text(48U, 236U, "CONFIDENCE", 1U, COLOR_MUTED);
  fill_rect(142U, 237U, 530U, 10U, COLOR_BAR_BACKGROUND);
  fill_rect(142U, 237U, bar_width, 10U, color);
  (void)snprintf(text, sizeof(text), "%lu%%", (unsigned long)bounded_percent);
  draw_text(696U, 233U, text, 2U, COLOR_WHITE);
}

static void draw_top_predictions(
    const char *const top_labels[AUDIO_EVENT_TOP_COUNT],
    const uint32_t top_percent[AUDIO_EVENT_TOP_COUNT])
{
  char percent_text[12];

  draw_text(48U, 309U, "TOP PREDICTIONS", 2U, COLOR_MUTED);
  for (uint32_t rank = 0U; rank < AUDIO_EVENT_TOP_COUNT; rank++)
  {
    const uint32_t y = 341U + rank * 31U;
    const uint32_t bounded_percent =
        (top_percent[rank] > 100U) ? 100U : top_percent[rank];
    const uint32_t bar_width = 4U * bounded_percent;

    draw_text(48U, y, friendly_label(top_labels[rank]), 2U,
              (rank == 0U) ? COLOR_WHITE : COLOR_MUTED);
    fill_rect(250U, y + 2U, 400U, 10U, COLOR_BAR_BACKGROUND);
    fill_rect(250U, y + 2U, bar_width, 10U,
              (rank == 0U) ? COLOR_CYAN : COLOR_BLUE);
    (void)snprintf(percent_text, sizeof(percent_text), "%lu%%",
                   (unsigned long)bounded_percent);
    draw_text(680U, y, percent_text, 2U,
              (rank == 0U) ? COLOR_WHITE : COLOR_MUTED);
  }
}

static void draw_live_card(
    const char *decision_label,
    uint32_t decision_percent,
    const char *const top_labels[AUDIO_EVENT_TOP_COUNT],
    const uint32_t top_percent[AUDIO_EVENT_TOP_COUNT])
{
  const bool waiting = (strcmp(decision_label, "waiting") == 0);
  const bool unknown = (strcmp(decision_label, "unknown") == 0);
  const char *primary_label = NULL;
  const char *subtitle = NULL;
  uint16_t accent = COLOR_GREEN;
  uint32_t label_scale = 5U;

  fill_rect(24U, 84U, 752U, 184U, COLOR_CARD);
  outline_rect(24U, 84U, 752U, 184U, 1U, COLOR_DIVIDER);
  draw_text(48U, 103U, "CURRENT SOUND", 2U, COLOR_MUTED);

  if (!s_monitoring_enabled)
  {
    primary_label = "PAUSED";
    subtitle = "PRESS USER1 TO RESUME MONITORING";
    accent = COLOR_ORANGE;
    decision_percent = 0U;
  }
  else if (!waiting)
  {
    const HazardLevel_t live_hazard = hazard_for_label(top_labels[0]);

    accent = unknown ? COLOR_ORANGE : hazard_color(live_hazard);
    primary_label = friendly_label(top_labels[0]);
    subtitle = unknown ? "LOW CONFIDENCE - NOT CONFIRMED" : "DETECTED";
    decision_percent = top_percent[0];
  }
  else
  {
    primary_label = "WAITING";
    subtitle = "LISTENING FOR SOUND";
    decision_percent = 0U;
  }

  if (text_width(primary_label, label_scale) > 690U)
  {
    label_scale = 4U;
  }
  draw_text_centered_in(48U, 704U, 146U, primary_label, label_scale, accent);
  draw_text_centered_in(48U, 704U, 197U, subtitle, 1U, COLOR_MUTED);
  draw_confidence(decision_percent, accent);

  fill_rect(24U, 286U, 752U, 142U, COLOR_CARD);
  outline_rect(24U, 286U, 752U, 142U, 1U, COLOR_DIVIDER);
  draw_top_predictions(top_labels, top_percent);
}

