aleksMuhicFri2/stm32n6-edge-audio-classifier/Projects/GS/Src/audio_display.c
static void draw_footer(void)
{
  char footer_text[64];

  fill_rect(0U, 444U, DISPLAY_WIDTH, 36U, COLOR_HEADER);
  if (s_alert_latched)
  {
    (void)snprintf(footer_text, sizeof(footer_text),
                   "ALERT: %s / PRESS TAMP TO CLEAR", s_alert_label);
    draw_text_centered_in(0U, DISPLAY_WIDTH, 456U, footer_text, 1U,
                          hazard_color(s_alert_hazard));
  }
  else
  {
    draw_text_centered_in(0U, DISPLAY_WIDTH, 456U,
                          "USER1 PAUSE / RESUME     5 SOUND CLASSES",
                          1U, COLOR_MUTED);
  }
}

static void render_dashboard(
    const char *decision_label,
    uint32_t decision_percent,
    const char *const top_labels[AUDIO_EVENT_TOP_COUNT],
    const uint32_t top_percent[AUDIO_EVENT_TOP_COUNT])
{
  fill_rect(0U, 0U, DISPLAY_WIDTH, DISPLAY_HEIGHT, COLOR_BACKGROUND);
  draw_header();
  draw_live_card(decision_label, decision_percent, top_labels, top_percent);
  draw_footer();
  clean_framebuffer();
}

static bool configure_panel(void)
{
  GPIO_InitTypeDef gpio = {0};
  RCC_OscInitTypeDef oscillator = {0};
  RCC_PeriphCLKInitTypeDef peripheral_clock = {0};

  oscillator.OscillatorType = RCC_OSCILLATORTYPE_NONE;
  oscillator.PLL1.PLLState = RCC_PLL_NONE;
  oscillator.PLL2.PLLState = RCC_PLL_NONE;
  oscillator.PLL3.PLLState = RCC_PLL_NONE;
  oscillator.PLL4.PLLState = RCC_PLL_ON;
  oscillator.PLL4.PLLSource = RCC_PLLSOURCE_HSI;
  oscillator.PLL4.PLLM = 8U;
  oscillator.PLL4.PLLFractional = 0U;
  oscillator.PLL4.PLLN = 225U;
  oscillator.PLL4.PLLP1 = 6U;
  oscillator.PLL4.PLLP2 = 6U;
  if (HAL_RCC_OscConfig(&oscillator) != HAL_OK)
  {
    return false;
  }

  peripheral_clock.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
  peripheral_clock.LtdcClockSelection = RCC_LTDCCLKSOURCE_IC16;
  peripheral_clock.ICSelection[RCC_IC16].ClockSelection = RCC_ICCLKSOURCE_PLL4;
  peripheral_clock.ICSelection[RCC_IC16].ClockDivider = 2U;
  if (HAL_RCCEx_PeriphCLKConfig(&peripheral_clock) != HAL_OK)
  {
    return false;
  }

  __HAL_RCC_LTDC_CLK_ENABLE();
  __HAL_RCC_LTDC_FORCE_RESET();
  __HAL_RCC_LTDC_RELEASE_RESET();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOQ_CLK_ENABLE();

  gpio.Mode = GPIO_MODE_AF_PP;
  gpio.Pull = GPIO_NOPULL;
  gpio.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio.Alternate = GPIO_AF14_LCD;
  gpio.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7 |
             GPIO_PIN_8 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOA, &gpio);
  gpio.Pin = GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_11 | GPIO_PIN_12 |
             GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOB, &gpio);
  gpio.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOD, &gpio);
  gpio.Pin = GPIO_PIN_11;
  HAL_GPIO_Init(GPIOE, &gpio);
  gpio.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_6 | GPIO_PIN_8 |
             GPIO_PIN_11 | GPIO_PIN_12;
  HAL_GPIO_Init(GPIOG, &gpio);
  gpio.Pin = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_6;
  HAL_GPIO_Init(GPIOH, &gpio);

  gpio.Mode = GPIO_MODE_OUTPUT_PP;
  gpio.Pull = GPIO_NOPULL;
  gpio.Pin = GPIO_PIN_1;
  HAL_GPIO_Init(GPIOE, &gpio);
  gpio.Pin = GPIO_PIN_3 | GPIO_PIN_6;
  HAL_GPIO_Init(GPIOQ, &gpio);
  gpio.Pin = GPIO_PIN_13;
  HAL_GPIO_Init(GPIOG, &gpio);

  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1, GPIO_PIN_RESET);
  HAL_Delay(20U);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1, GPIO_PIN_SET);
  HAL_Delay(20U);

  LTDC->GCR &= ~(LTDC_GCR_HSPOL | LTDC_GCR_VSPOL |
                 LTDC_GCR_DEPOL | LTDC_GCR_PCPOL);
  LTDC->SSCR = (3U << 16U) | 3U;
  LTDC->BPCR = (7U << 16U) | 7U;
  LTDC->AWCR = (807U << 16U) | 487U;
  LTDC->TWCR = (811U << 16U) | 491U;
  LTDC->BCCR = 0U;

  LTDC_Layer1->WHPCR = (807U << 16U) | 8U;
  LTDC_Layer1->WVPCR = (487U << 16U) | 8U;
  LTDC_Layer1->PFCR = 4U;
  LTDC_Layer1->DCCR = 0U;
  LTDC_Layer1->CACR = 255U;
  LTDC_Layer1->BFCR = 0x0607U;
  LTDC_Layer1->CFBAR = LCD_LAYER_0_ADDRESS;
  LTDC_Layer1->CFBLR = (1600U << 16U) | 1607U;
  LTDC_Layer1->CFBLNR = DISPLAY_HEIGHT;
  LTDC_Layer1->CR = LTDC_LxCR_LEN;
  LTDC_Layer1->RCR = LTDC_LxRCR_IMR | LTDC_LxRCR_GRMSK;

  LTDC->GCR |= LTDC_GCR_LTDCEN;
  HAL_GPIO_WritePin(GPIOQ, GPIO_PIN_3 | GPIO_PIN_6, GPIO_PIN_SET);
  HAL_GPIO_WritePin(GPIOG, GPIO_PIN_13, GPIO_PIN_SET);
  return true;
}

void AudioDisplay_SecurityConfig(void)
{
  RIMC_MasterConfig_t master = {0};

  __HAL_RCC_RIFSC_CLK_ENABLE();
  master.MasterCID = RIF_CID_1;
  master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
  (void)HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1, &master);
  (void)HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2, &master);
  (void)HAL_RIF_RISC_SetSlaveSecureAttributes(
      RIF_RISC_PERIPH_INDEX_LTDC, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  (void)HAL_RIF_RISC_SetSlaveSecureAttributes(
      RIF_RISC_PERIPH_INDEX_LTDCL1, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  (void)HAL_RIF_RISC_SetSlaveSecureAttributes(
      RIF_RISC_PERIPH_INDEX_LTDCL2, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
}

bool AudioDisplay_Init(void)
{
  static const char *initial_top_labels[AUDIO_EVENT_TOP_COUNT] =
      {"dog_bark", "glass_breaking", "gunshot_gunfire"};
  static const uint32_t initial_top_percent[AUDIO_EVENT_TOP_COUNT] = {0U, 0U, 0U};

  s_display_ready = false;
  s_acknowledge_requested = false;
  s_monitoring_enabled = true;
  s_framebuffer = (volatile uint16_t *)LCD_LAYER_0_ADDRESS;
  s_active_framebuffer_address = LCD_LAYER_0_ADDRESS;
  s_session_active = false;
  s_session_recognized = false;
  s_session_label[0] = '\0';
  s_session_percent = 0U;
  s_session_hazard = HAZARD_INFO;
  s_challenger_label[0] = '\0';
  s_challenger_count = 0U;
  memset(s_history, 0, sizeof(s_history));
  s_event_count = 0U;
  s_alert_count = 0U;
  s_alert_latched = false;
  s_alert_label[0] = '\0';
  s_alert_hazard = HAZARD_INFO;
  s_last_render_second = UINT32_MAX;
  s_last_decision[0] = '\0';
  s_last_decision_percent = UINT32_MAX;
  for (uint32_t rank = 0U; rank < AUDIO_EVENT_TOP_COUNT; rank++)
  {
    s_last_top_labels[rank][0] = '\0';
    s_last_top_percent[rank] = UINT32_MAX;
  }

  render_dashboard("waiting", 0U, initial_top_labels, initial_top_percent);
  s_display_ready = configure_panel();
  return s_display_ready;
}

